tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "asdf"
brew "direnv"
brew "eza"
brew "fish"
brew "fzf"
brew "git"
brew "golang-migrate"
brew "hurl"
brew "jq"
brew "pgcli"
brew "podman"
brew "ripgrep"
brew "starship"
cask "arc"
cask "bruno"
cask "discord"
cask "disk-inventory-x"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "iina"
cask "karabiner-elements"
cask "raycast"
cask "setapp"
cask "spotify"
cask "transmission"
cask "wezterm"
